{
    "Food and Beverage": [
        {
            "id": 1,
            "title": "Aiyu Jelly",
            "description": "Aiyu Jelly is a refreshing Taiwanese dessert made from the gel of a unique fig seed. It is known for its smooth and silky texture that pairs perfectly with citrus-based syrups. Often served chilled, it is a popular choice during hot weather. The jelly has a delicate flavor, making it a light and guilt-free dessert option. Aiyu Jelly is not only delicious but also a treat for anyone seeking something healthy and hydrating.",
            "price": "RM 5.00",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 2,
            "title": "Bubur Cha Cha",
            "description": "Bubur Cha Cha is a sweet and creamy Malaysian dessert made with yam, sweet potato, and tapioca pearls. The dish is cooked in a rich coconut milk base that enhances its sweetness. It has a delightful mix of textures, from the softness of yam to the chewiness of tapioca pearls. Served either hot or chilled, it caters to all preferences. This vibrant dessert is a must-try for anyone who enjoys comforting and colorful treats.",
            "price": "RM 6.50",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 3,
            "title": "Rojak",
            "description": "Rojak is a famous Southeast Asian salad featuring a mix of fruits, vegetables, and fritters. These ingredients are tossed in a tangy and spicy dressing made from shrimp paste and tamarind. The combination of sweet, sour, and spicy flavors is truly unique. Each bite offers a satisfying crunch from the fritters and fresh produce. Rojak is a vibrant and flavorful snack loved by locals and tourists alike.",
            "price": "RM 8.00",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 4,
            "title": "Char Kuey Teow",
            "description": "Char Kuey Teow is a popular Malaysian stir-fried noodle dish with a smoky aroma. It features flat rice noodles stir-fried with prawns, egg, and bean sprouts. The dish is cooked over high heat to achieve the signature 'wok hei' flavor. Its bold and savory taste is enhanced by soy sauce and chili paste. Char Kuey Teow is a hearty and satisfying meal for noodle lovers.",
            "price": "RM 10.00",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 5,
            "title": "Chee Cheong Fun",
            "description": "Chee Cheong Fun is a soft and silky rice noodle roll commonly found in Malaysia. These rolls are served with a sweet and savory sauce that enhances their flavor. The dish is often garnished with sesame seeds and fried shallots for added texture. It is a versatile meal that can be enjoyed as breakfast or a light snack. Chee Cheong Fun is a comforting and flavorful dish for all ages.",
            "price": "RM 4.50",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 6,
            "title": "Hokkien Mee",
            "description": "Hokkien Mee is a beloved noodle dish packed with rich and savory flavors. It combines thick yellow noodles with prawns, pork slices, and a flavorful broth. The dish is often served with sambal chili and lime on the side for an added kick. Its complex flavors come from the caramelized dark soy sauce used in cooking. Hokkien Mee is a filling and satisfying meal perfect for any occasion.",
            "price": "RM 12.00",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 7,
            "title": "Ice Cendol",
            "description": "Ice Cendol is a traditional Malaysian dessert that is both refreshing and indulgent. It features shaved ice topped with coconut milk, palm sugar syrup, and green pandan jelly. The dish is perfect for cooling down on a hot day while enjoying its rich flavors. The creamy coconut milk pairs beautifully with the caramel-like sweetness of palm sugar. Ice Cendol is a must-try dessert for those who love tropical flavors.",
            "price": "RM 5.50",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 8,
            "title": "Ice Kacang",
            "description": "Ice Kacang is a colorful and delightful shaved ice dessert from Malaysia. It is topped with a variety of ingredients, including syrups, sweet corn, red beans, and jelly. The combination of textures and flavors makes it an exciting treat. Often served with a scoop of ice cream, it is a favorite among both kids and adults. Ice Kacang is a perfect choice for anyone looking for a sweet and refreshing dessert.",
            "price": "RM 6.00",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        }
    ],
    
    "Culture and Heritage": [
        {
            "id": 1,
            "title": "Penang Hill Mosque",
            "description": "The Penang Hill Mosque is a serene and picturesque place of worship situated atop Penang Hill. Its modern Islamic architecture blends harmoniously with the lush greenery of its surroundings. The mosque serves both locals and tourists, offering a tranquil space for prayer and reflection. Visitors are captivated by the stunning panoramic views of George Town and the island from its vicinity. It stands as a symbol of peace and unity for the multicultural community in Penang.",
            "address": "Penang Hill, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 2,
            "title": "Clan Jetty",
            "description": "Clan Jetty is a historic waterfront settlement that dates back to the 19th century, housing Penang’s Chinese clans. Built on stilts over the water, these wooden houses and walkways reflect the unique heritage of Penang's early Chinese immigrants. Each jetty is named after a specific clan, such as the Chew Jetty, the most well-known among tourists. The area is a bustling hub, offering insight into traditional lifestyles, with vibrant festivals celebrated during major Chinese events. Visitors often enjoy the scenic view of the waterfront and the warm hospitality of the local community.",
            "address": "Weld Quay, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 3,
            "title": "Penang Street Wall Murals",
            "description": "The Penang Street Wall Murals are an iconic part of George Town’s UNESCO World Heritage Site. Created by Lithuanian artist Ernest Zacharevic, the murals depict scenes of everyday life and cultural heritage in a whimsical style. These interactive artworks often incorporate real objects, such as a bicycle or a swing, making them a favorite photo spot for visitors. The murals have revitalized the old streets of George Town, blending art with heritage. Exploring these murals is a must-do activity for anyone visiting Penang.",
            "address": "George Town, Penang",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 4,
            "title": "Khoo Kongsi",
            "description": "Khoo Kongsi is one of the grandest Chinese clan houses in Malaysia, showcasing the rich cultural heritage of the Khoo clan. Built in the 19th century, its ornate architecture and intricate carvings are a testament to traditional Chinese craftsmanship. The clan house serves as a cultural and community center, preserving the clan's history and heritage. Visitors can explore the courtyard, ancestral hall, and exhibits that highlight the life of early Chinese settlers in Penang. Khoo Kongsi is a must-visit landmark for its cultural significance and architectural splendor.",
            "address": "Cannon Square, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 5,
            "title": "Esplanade",
            "description": "The Esplanade is a scenic waterfront promenade in the heart of George Town, offering breathtaking views of the sea. It is a popular gathering spot for both locals and tourists, often hosting cultural events and public performances. The site is surrounded by historical landmarks, including Fort Cornwallis and City Hall, adding to its charm. Visitors can stroll along the promenade, enjoy the cool sea breeze, and savor local street food at nearby hawker stalls. The Esplanade is a vibrant and iconic location that showcases the spirit of Penang.",
            "address": "Esplanade Road, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 6,
            "title": "Queen Victoria Memorial Clock Tower",
            "description": "The Queen Victoria Memorial Clock Tower is a prominent colonial-era landmark in Penang, built in 1897 to commemorate Queen Victoria’s Diamond Jubilee. Standing 60 feet tall, the tower's design blends Moorish and Victorian architectural styles. Each foot of the structure represents a year of Queen Victoria’s reign. The clock tower remains a historical and cultural icon, situated near Fort Cornwallis and the waterfront. Visitors are drawn to its elegance and the nostalgic charm it brings to George Town's heritage landscape.",
            "address": "Light Street, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 7,
            "title": "City Hall and Town Hall",
            "description": "City Hall and Town Hall are majestic colonial buildings that reflect Penang’s rich architectural heritage. Built during the British colonial era, these structures showcase Edwardian Baroque and Palladian styles. The City Hall is still in use as a government office, while the Town Hall serves as a venue for events and exhibitions. Both buildings are located near the Esplanade, offering a picturesque setting for photography enthusiasts. They stand as symbols of Penang's historical significance and cultural diversity.",
            "address": "Padang Kota Lama, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 8,
            "title": "Fort Cornwallis",
            "description": "Fort Cornwallis is the largest standing fort in Malaysia, built in the late 18th century by the British East India Company. Named after Charles Cornwallis, the fort was constructed to protect Penang from naval attacks. Today, it serves as a historical site, featuring cannons, a lighthouse, and exhibits detailing Penang’s colonial history. Visitors can explore the fort’s well-preserved structures and learn about its strategic importance. Fort Cornwallis is a key attraction for history enthusiasts and those interested in Penang’s colonial past.",
            "address": "Jalan Tun Syed Sheh Barakbah, George Town",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        }

        ],

    "Nature and Wildlife": [
        {
            "id": 1,
            "title": "Penang National Park",
            "description": "Penang National Park is a pristine natural reserve located on the northwest corner of Penang Island. It is home to diverse ecosystems, including mangroves, rainforests, and coastal beaches. The park features popular trails leading to iconic sites like the Lighthouse and Turtle Beach. Visitors can enjoy hiking, birdwatching, and boat rides while immersing themselves in nature. This park offers an unparalleled experience for nature lovers and adventure enthusiasts.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 2,
            "title": "Monkey Beach",
            "description": "Monkey Beach is a secluded and scenic beach within Penang National Park. Known for its clear waters and lush surroundings, the beach is accessible via hiking trails or boat rides. True to its name, visitors often spot playful monkeys in the area, adding to the charm of the beach. It is a perfect spot for relaxation, picnics, and water activities such as swimming and kayaking. The tranquil atmosphere and natural beauty make Monkey Beach a hidden gem in Penang.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 3,
            "title": "Penang Bird Park",
            "description": "Penang Bird Park is Malaysia's first and largest bird park, housing over 300 species of birds from around the world. Spanning five acres, the park features beautifully landscaped gardens, ponds, and aviaries. Visitors can enjoy close encounters with exotic birds such as flamingos, hornbills, and parrots. Educational exhibits and feeding sessions make it a family-friendly destination. The park is a haven for bird enthusiasts and a must-visit for those interested in wildlife.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 4,
            "title": "The Habitat Penang Hill",
            "description": "The Habitat Penang Hill offers a unique rainforest experience, featuring a canopy walk, tree-top views, and diverse flora and fauna. Located on Penang Hill, it is an eco-tourism attraction that promotes environmental conservation. Visitors can explore guided nature trails, a giant swing, and observation decks with panoramic views. The Habitat provides an educational experience, showcasing the importance of preserving biodiversity. It is a serene escape into the heart of nature, ideal for families and eco-enthusiasts.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 5,
            "title": "Monitor Lizard",
            "description": "Monitor lizards are commonly spotted in the natural habitats of Penang, including the forests and mangroves. These large reptiles are harmless to humans and play an essential role in the ecosystem. Known for their agility and swimming skills, they are often seen basking in the sun or foraging for food. Visitors may encounter them at Penang National Park or near water bodies. Monitor lizards are a fascinating species that highlight Penang's rich biodiversity.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 6,
            "title": "Otter",
            "description": "Otters are playful and social creatures found in the waterways and mangroves of Penang. These semi-aquatic mammals are known for their sleek bodies and excellent swimming abilities. Visitors can occasionally spot otters near Penang National Park or coastal areas, often in small family groups. They are an important part of the local ecosystem, contributing to the health of aquatic environments. Observing these charming animals in their natural habitat is a delightful experience.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 7,
            "title": "Sunda Colugo",
            "description": "The Sunda Colugo, also known as the Malayan flying lemur, is a unique nocturnal mammal found in Penang’s rainforests. Known for its ability to glide between trees, it has a distinctive membrane connecting its limbs. These shy creatures are rarely seen during the day but can be spotted in the trees at night. They primarily feed on leaves, flowers, and fruits, playing a role in the forest's ecosystem. The Sunda Colugo is a fascinating species that highlights Penang's rich wildlife diversity.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 8,
            "title": "Sunda Slow Loris",
            "description": "The Sunda Slow Loris is a small, nocturnal primate native to Penang’s forests. Recognized by its big round eyes and slow movements, it is a tree-dwelling species that feeds on fruits, insects, and tree sap. Despite its cute appearance, it has a venomous bite used for self-defense. The Sunda Slow Loris is a protected species due to habitat loss and illegal pet trade. Spotting one in the wild is a rare and enchanting experience for wildlife enthusiasts.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 9,
            "title": "Wild Boar",
            "description": "Wild boars are commonly found in the forests and rural areas of Penang. These robust animals are known for their keen sense of smell and foraging habits. They play an important role in the ecosystem by helping with seed dispersal and soil turnover. While generally shy, wild boars may occasionally be spotted by hikers in Penang National Park or other forested areas. Observing them from a safe distance offers an insight into the island's native wildlife.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 10,
            "title": "Dolphin",
            "description": "Dolphins are a delightful sight in the coastal waters surrounding Penang. These intelligent marine mammals are occasionally seen swimming and leaping in pods near the Straits of Malacca. Dolphin-watching tours provide opportunities for visitors to experience their playful behavior up close. They symbolize the rich marine biodiversity of Penang and the need for its conservation. Encountering dolphins in the wild is a magical experience for nature lovers and adventurers.",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        }

        ],

    "Accomodations": [
    {
        "id": 1,
        "title": "JomStay At Penang",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 120 - RM 250 per night",
        "image": ""
    },
    {
        "id": 2,
        "title": "Aayu Melayu",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 150 - RM 300 per night",
        "image": ""
    },
    {
        "id": 3,
        "title": "BayView Hotel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 180 - RM 350 per night",
        "image": ""
    },
    {
        "id": 4,
        "title": "Grand Swiss Hotel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 200 - RM 400 per night",
        "image": ""
    },
    {
        "id": 5,
        "title": "Kimberley Hotel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 130 - RM 250 per night",
        "image": ""
    },
    {
        "id": 6,
        "title": "Tido Penang Hostel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 50 - RM 150 per night",
        "image": ""
    },
    {
        "id": 7,
        "title": "Cititel Express Hotel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 140 - RM 280 per night",
        "image": ""
    },
    {
        "id": 8,
        "title": "Tune Hotel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 90 - RM 200 per night",
        "image": ""
    },
    {
        "id": 9,
        "title": "Citivilla Hotel",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 150 - RM 300 per night",
        "image": ""
    },
    {
        "id": 10,
        "title": "Cocoa Meows And Homestay",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 100 - RM 220 per night",
        "image": ""
    }
],

    "Beaches": [
        {
            "id": 1,
            "title": "Pantai Tropika",
            "description": "Pantai Tropika is a hidden gem in Penang, known for its pristine sands and serene atmosphere. This tranquil beach is perfect for those seeking relaxation away from the crowds. Its picturesque surroundings make it a great spot for photography and peaceful strolls.",
            "address": "Pantai Tropika, Penang",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 2,
            "title": "Tanjung Bungah",
            "description": "Tanjung Bungah is a popular beach destination, offering calm waters and stunning views. It is ideal for swimming, picnics, and family outings. Visitors can also enjoy nearby resorts and local seafood restaurants for a complete beach experience.",
            "address": "Tanjung Bungah, Penang",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 3,
            "title": "Teluk Bahang Beach",
            "description": "Teluk Bahang Beach is located near the Penang National Park, offering a peaceful retreat surrounded by nature. Its clear waters and lush greenery attract both locals and tourists. The beach is also a starting point for boat trips to other scenic spots in the area.",
            "address": "Teluk Bahang, Penang",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 4,
            "title": "Kerachut Beach",
            "description": "Kerachut Beach is a secluded paradise within Penang National Park, famous for its Turtle Sanctuary. Accessible via hiking trails or boat rides, it is perfect for nature lovers. Its pristine beauty and serene environment make it a must-visit beach in Penang.",
            "address": "Teluk Bahang, Penang",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        },
        {
            "id": 5,
            "title": "Batu Ferringhi",
            "description": "Batu Ferringhi is one of Penang’s most famous beaches, known for its vibrant nightlife and water sports activities. Visitors can enjoy jet skiing, parasailing, or simply relax by the shore. The nearby night market and dining options add to its appeal, making it a lively destination.",
            "address": "Batu Ferringhi, Penang",
            "rating": "⭐⭐⭐⭐⭐",
            "image": ""
        }

    ],

    "Farm and Animals": [
    {
        "id": "1",
        "title": "Entopia",
        "description": "Entopia is a unique nature sanctuary where butterflies and insects roam freely in lush tropical gardens. It combines education and entertainment, offering interactive exhibits and hands-on activities for visitors of all ages. With its beautiful landscapes and immersive experiences, Entopia is a must-visit destination for nature enthusiasts.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Teluk Bahang, Penang",
        "price": "RM 50 - RM 70 (depending on age and package)",
        "image": ""
    },
    {
        "id": "2",
        "title": "Tropical Fruit Farm",
        "description": "Tropical Fruit Farm is a haven for fruit lovers, showcasing a wide variety of tropical fruits in a lush hilltop setting. Visitors can enjoy guided tours, fruit tasting sessions, and learn about sustainable farming practices. The panoramic views of the surrounding countryside add to its charm, making it a delightful experience for all.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Balik Pulau, Penang",
        "price": "RM 30 - RM 60 (depending on package)",
        "image": ""
    },
    {
        "id": "3",
        "title": "Bao Sheng Durian Farm",
        "description": "Bao Sheng Durian Farm is a paradise for durian lovers, offering the chance to taste fresh, premium-quality durians straight from the orchard. The farm also provides guided tours to educate visitors about durian cultivation and its varieties. Surrounded by lush greenery, it’s a must-visit for those who appreciate this iconic fruit.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Balik Pulau, Penang",
        "price": "RM 40 - RM 80 (for durian tasting and tour)",
        "image": ""
    },
    {
        "id": "4",
        "title": "Saanen Dairy Goat Farm",
        "description": "Saanen Dairy Goat Farm is a charming spot where visitors can interact with friendly goats and learn about dairy production. The farm offers fresh goat milk and other dairy products for purchase. It's a great educational and fun experience, especially for families with children.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Balik Pulau, Penang",
        "price": "RM 10 - RM 20 (for entry and activities)",
        "image": ""
    },
    {
        "id": "5",
        "title": "Audi Dream Farm",
        "description": "Audi Dream Farm is a family-friendly attraction featuring a variety of animals and plants. Visitors can feed and pet the animals, including rabbits, chickens, and goats, making it an interactive experience. The farm also grows organic vegetables, offering a wholesome and enjoyable outing for all ages.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Balik Pulau, Penang",
        "price": "RM 10 - RM 20 (for entry and activities)",
        "image": ""
    }
],

    "Themeparks": [
    {
        "id": "1",
        "title": "Escape Theme Park",
        "description": "Escape Theme Park is an award-winning adventure destination in Penang that offers exciting outdoor activities for all ages. From ziplining and climbing to the world’s longest tube water slide, it promises an adrenaline-packed experience. Nestled in a lush natural environment, it’s a must-visit for thrill-seekers and families alike.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Teluk Bahang, Penang",
        "price": "RM 70 - RM 140 (depending on package)",
        "image": ""
    },
    {
        "id": "2",
        "title": "The Top Penang",
        "description": "The Top Penang is a multi-attraction theme park located in the heart of George Town. It features the Rainbow Skywalk, a glass walkway with breathtaking views, and other attractions like Jurassic Research Center and Tech Dome Penang. This urban theme park is perfect for a day of family-friendly fun.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "Komtar, George Town, Penang",
        "price": "RM 40 - RM 60 (depending on attractions)",
        "image": ""
    },
    {
        "id": "3",
        "title": "Kidland",
        "description": "Kidland is a children’s theme park that offers a variety of educational and interactive activities for kids. It includes role-playing stations where children can experience different professions in a fun and engaging way. Located in the city, it’s a great spot for family outings with younger kids.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 30 - RM 50 (per child)",
        "image": ""
    },
    {
        "id": "4",
        "title": "Dip Play Cafe",
        "description": "Dip Play Cafe combines the concept of a cafe and play area, offering a relaxing environment for parents while kids enjoy interactive games. The cafe serves delicious snacks and drinks, making it a great spot for families to unwind. Its creative play zones ensure children have a memorable time.",
        "rating": "⭐⭐⭐⭐⭐",
        "address": "George Town, Penang",
        "price": "RM 10 - RM 25 (for play area, food and drinks extra)",
        "image": ""
    }
],


    "Transportation": [
    {
        "id": "1",
        "title": "Rapid Penang Bus",
        "description": "Rapid Penang is the island's primary public bus service, offering affordable and reliable transportation. The buses connect major attractions, residential areas, and towns across Penang, including George Town and Balik Pulau. With air-conditioned comfort and frequent schedules, it's a popular choice for locals and tourists alike.",
        "rating": "⭐⭐⭐⭐",
        "price": "RM 1 - RM 5",
        "image": ""
    },
    {
        "id": "2",
        "title": "Penang Ferry",
        "description": "The Penang Ferry is an iconic mode of transportation connecting Butterworth on the mainland to George Town on the island. It offers scenic views of the coastline and a unique way to experience Penang’s maritime heritage. The ferry accommodates both passengers and vehicles, making it a convenient option.",
        "rating": "⭐⭐⭐⭐⭐",
        "price": "RM 1.20 - RM 7.00 (varies by vehicle)",
        "image": ""
    },
    {
        "id": "3",
        "title": "Trishaw (Beca)",
        "description": "Trishaws, or becas, are a nostalgic and eco-friendly way to explore the streets of George Town. Operated by local riders, they provide a slow-paced and scenic tour of the city’s heritage sites. It’s a charming option for tourists seeking an authentic Penang experience.",
        "rating": "⭐⭐⭐⭐",
        "price": "RM 40 - RM 60 (per hour)",
        "image": ""
    },
    {
        "id": "4",
        "title": "Penang International Airport",
        "description": "Penang International Airport serves as the main gateway to the island, connecting it to both domestic and international destinations. Located in Bayan Lepas, it offers a range of facilities, including restaurants, shops, and transportation services. The airport is a hub for travelers exploring Penang and beyond.",
        "rating": "⭐⭐⭐⭐⭐",
        "price": "Varies by flight",
        "image": ""
    },
    {
        "id": "5",
        "title": "Motorcycle Rentals",
        "description": "Motorcycle rentals are a popular choice for exploring Penang, offering flexibility and ease of navigation. Affordable and efficient, they allow travelers to reach hidden gems and scenic spots at their own pace. Riding through the island’s roads is a thrilling way to experience its culture and nature.",
        "rating": "⭐⭐⭐⭐",
        "price": "RM 30 - RM 60 (per day)",
        "image": ""
    },
    {
        "id": "6",
        "title": "Grab (E-Hailing)",
        "description": "Grab is Penang’s most widely used e-hailing service, offering convenient and efficient transportation. With competitive pricing and availability across the island, it’s ideal for short trips or getting to remote locations. The app-based service provides a hassle-free travel option for both locals and tourists.",
        "rating": "⭐⭐⭐⭐⭐",
        "price": "RM 6 - RM 40 (depending on distance)",
        "image": ""
    }
]

}